{
  "summaries": {
    "addressing": "A Brazilian postal code to address lookup service that converts ZIP codes into full address information. The project provides a service manager for handling postal code queries and address resolution.",
    "algorit": "Algorit is a work-in-progress web application combining a Vue.js and Sass frontend built with Laravel Elixir (Gulp) with a PHP and Lumen backend. The project provides a full-stack framework for algorithmic applications with modern frontend tooling and lightweight backend architecture.",
    "algorit.com.br": "Website code for http://algorit.com.br.",
    "aposente.ai": "",
    "autopilot": "An automated vault system on Solana that allows users to invest single assets in concentrated liquidity pools with auto-compounding and rebalancing. The strategy uses market analysis to calculate optimal swap amounts and position ranges, then automatically collects fees every 5 minutes and rebalances based on risk parameters. It maximizes returns by leveraging concentrated liquidity while minimizing manual intervention.",
    "backup": "",
    "basedash": "A PHP-based web application framework built on Laravel that provides database management and administration capabilities. It uses Composer for PHP dependencies, Node.js tooling for asset management, and includes comprehensive testing via PHPUnit. The project supports database migrations and includes a system for syncing and managing database operations through command-line artisan commands.",
    "bean": "A personal finance and investment management system built with Beancount for accounting, featuring plain text transaction imports from financial institutions, portfolio analysis tools, and quantitative screeners for stock ranking and factor-based investing across B3 (Brazilian) and US markets.",
    "bliv": "A DeFi application built on Solana that enables users to liberate and optimize yields through smart contracts and a web interface. The project consists of a Rust-based Anchor smart contract program, a Next.js frontend, and a CLI tool, all managed through a comprehensive development setup with a local validator for testing. It provides tools for creating and managing demo markets, with deployment available at bliv-app.vercel.app.",
    "bot": "A TypeScript trading bot for cryptocurrency markets that supports multiple technical analysis strategies including SMA crossover, RSI, MACD, Bollinger Bands, SuperTrend, and Smart Money Concepts analysis. It provides real-time market data fetching via CCXT, continuous candle streaming, signal generation, and trade execution across various exchanges and protocols. The bot uses a flexible YAML configuration system and includes backtesting capabilities for strategy validation.",
    "bovespa.io": "Fundamentando is a PHP Laravel application for the bovespa.io stock market platform that requires Composer for dependency management, database migrations/seeds, and NPM/Bower/Gulp for frontend asset building. It includes PHPUnit testing with code coverage reporting capabilities.",
    "bulldesk-gridsome": "A Gridsome starter project that combines Vue.js, GraphQL, and Bootstrap to generate static websites with built-in CMS integration via Forestry.io, Netlify forms, and automatic deployment capabilities. It provides a production-ready foundation with Sass styling, markdown content support, Google Analytics, and sitemap generation for developers seeking a modern, low-cost jamstack solution. Designed for easy setup with Netlify and Github, requiring minimal configuration to launch a fully functional website.",
    "bulldesk-landing": "",
    "bulldesk-lp": "",
    "bulldesk-teaser": "",
    "buscape": "",
    "cashier-iugu": "",
    "classification": "A Laravel application that classifies company attributes using an attribution classifier system. The project includes a Company model, AttributionClassifier logic, and a Classification class with corresponding unit tests that can be executed via PHPUnit.",
    "claudio": "",
    "content-course": "A high-converting landing page for selling digital courses that accepts payments via both Stripe (credit cards) and Solana (cryptocurrency), built with Nuxt.js 3 and Tailwind CSS. The page is optimized for conversion with responsive design, pricing strategy documentation, and complete payment flow integration including webhook verification and course access management through Supabase.",
    "contracts": "A Solana smart contracts repository containing four programs: Gamed, Governance, Token Vesting, and Twister. Development uses Next.js for the frontend and a worker process that can be deployed to devnet. The project provides tooling for starting the development server and running background workers.",
    "defi-automator": "A tool for automating decentralized finance portfolios on Solana's Orca Whirlpools through algorithmic strategies that manage concentrated liquidity positions, auto-rebalance them, and collect fees and rewards. Currently supports position initialization strategies like One Tick Lower/Upper and is designed to expand to more protocols and blockchain networks. The project is in early development and built with Node.js, Yarn, Solana CLI, and MongoDB.",
    "dotfiles": "Configuration management system for macOS that syncs dotfiles, installs development tools and coding agents, and restores application settings through a just-based workflow. Covers shell configuration (zsh, tmux), terminal apps (neovim, ghostty), and system setup automation. Includes security hardening templates and backup/restore capabilities via mackup.",
    "gabrielkoerich": "A technical entrepreneur and software engineer with 17+ years of experience building scalable systems and DeFi protocols, primarily using Rust and the Solana ecosystem. Currently architecting smart contracts at Lulo, a protocol with over $100M in total value locked, and previously founded Bulldesk, a marketing automation SaaS acquired in 2021.",
    "gabrielkoerich.github.io": "A static site generator built with Zola that displays a portfolio of GitHub repositories with metadata, language statistics, and AI-generated summaries. It fetches repository information from the GitHub API and combines it with LLM-generated descriptions to create a comprehensive projects showcase. The site is automatically rebuilt and deployed to GitHub Pages on schedule and on code push.",
    "granatum-php": "A PHP 7+ library that provides programmatic access to the Granatum API for financial management. It enables developers to integrate Granatum's financial services into PHP applications with a clean, straightforward interface. The library is designed to work with PHP 7 and later versions.",
    "guidelines": "A collection of coding guidelines for PHP, HTML, CSS, and JavaScript projects that enforce PSR-2 and PSR-4 standards for PHP, mandate 2-space indentation for front-end languages and 4-space for PHP, and require GitHub Flow contributions to the develop branch with proper documentation and review processes. The guidelines cover PHPDoc formatting, HTML structure conventions, and general best practices for maintaining consistent code quality across the team.",
    "home": "A collection of containerized services for running a home server setup. This project manages multiple Docker containers to provide various services for a home environment. It handles deployment and orchestration of these container-based applications.",
    "homebrew-tap": "",
    "iafut": "",
    "innbox": "",
    "lighthouse": "",
    "lulo-cpi-example": "A Solana smart contract example demonstrating user vaults that integrate with Lulo via Cross-Program Invocation (CPI) to enable deposits, withdrawals, and interest-earning opportunities. Users can deposit tokens to vaults and transfer them to Lulo for yield, while withdrawals are handled either directly from the vault or asynchronously through Lulo depending on available liquidity. The pattern is designed to be adaptable for protocol reserves where only administrators control deposits and withdrawals.",
    "meshbot": "Multi-agent orchestration framework that coordinates autonomous tasks across specialized AI agents with support for scheduling, queuing, and multi-channel integration via Telegram and Discord. Routes work between agents with different capabilities, persists state to file or SQLite, and provides isolated execution modes for delegated tasks. Designed as an extensible scaffold for building agent meshes that can autonomously handle workflows or intelligently delegate to more capable peers.",
    "mev": "A Rust-based starter template for building MEV bots on Solana that leverages Jito's searcher and geyser clients to identify and execute backrun arbitrage opportunities across DEXs like Raydium and Orca. The included reference implementation monitors the mempool for large trades, calculates profitable arbitrage routes, and executes backrun transactions through Jito bundles to capture MEV from price imbalances.",
    "mind": "",
    "orchestrator": "A lightweight bash orchestrator that routes coding tasks to specialized AI agents (Claude, Codex, OpenCode) with dynamic skill selection and task delegation. It uses YAML as a source of truth for task management, spawns agents in full agentic mode with tool access, and tracks execution metadata including token usage and status. All state lives in ~/.orchestrator/ with configuration in tasks.yml, jobs.yml, and per-project overrides.",
    "pass": "",
    "passive-trading": "A cryptocurrency trading bot that operates on perpetual futures across multiple exchanges including Bybit, OKX, Binance, and Hyperliquid, using a contrarian market-making strategy inspired by the Martingale betting approach to create grid-based buy and sell orders. The bot automatically enters and exits positions with configurable trailing orders, dynamic market selection via its Forager feature, and an included backtester and optimizer written partially in Rust for performance. It requires minimal user intervention and can be backtested and optimized using historical price data with evolutionary algorithms.",
    "portfolio": "A Rust-based portfolio manager that executes multiple trading strategies on Solana with support for perpetual futures, borrowing/lending, and yield protocols. It provides backtesting capabilities, real-time allocation monitoring with alerts, and actionable suggestions for position management including increases, decreases, exits, and hedges. The system deploys via Docker for streamlined strategy execution.",
    "portfolio-guardian-saas": "A full-stack SaaS application built with Nuxt.js and Supabase that monitors Solana cryptocurrency portfolios with real-time balance tracking, P&L analysis, and AI-powered insights across multiple wallets. The platform offers tiered subscription plans ranging from free single-wallet monitoring to enterprise-level unlimited wallet access with persistent historical data and API integrations. Features include automated Telegram alerts, OAuth authentication, and dashboard visualizations for tracking portfolio performance and trading positions.",
    "private": "A collection of utilities for managing privacy and backup operations. Provides command-line tools and scripts to help users secure and preserve their data across systems.",
    "private-sol": "",
    "prospector": "",
    "python-agents-course": "A Nuxt.js 3 landing page for selling digital courses with integrated Stripe and Solana payment options, enabling creators to accept both credit cards and cryptocurrency. Features responsive design, high-conversion optimization, and optional Supabase integration for course access management. Deploys easily to Vercel with webhook-based payment verification for secure transaction handling.",
    "quant": "A quantitative finance project focused on algorithmic trading, financial analysis, or market data processing. The minimal documentation suggests this is an early-stage or specialized repository without extensive public-facing documentation yet.",
    "service-manager": "A simple manager that runs services in sequence. It provides a lightweight way to orchestrate and execute multiple services one after another. Licensed under MIT.",
    "skills": "A collection of independent, self-contained skills for AI agents, each with its own directory and SKILL.md documentation file. Skills are configured entirely through environment variables in a gitignored .env file, with an interactive setup script that handles dependency checking, API key configuration, and smoke tests. The skills follow the Agent Skills open standard and work with any agent that supports it, including Claude Code, Codex, and OpenClaw.",
    "smart-money-concepts": "A TypeScript library that implements Smart Money Concepts (SMC) and ICT market structure analysis to detect trading patterns like order blocks, fair value gaps, breaks of structure, and liquidity grabs from OHLCV candle data. It provides zero-dependency real-time and bulk processing capabilities with methods to query current market bias, price zones, and order block positions for trading analysis.",
    "solana-fib-cpi": "A minimal Solana program that computes Fibonacci sequences using recursive self-CPI calls, demonstrating the modular v2 crates without Anchor or frameworks. It maintains state in a PDA and advances the sequence by one step per invocation, with support for up to 4 recursive steps per transaction due to Solana's invoke stack depth limit.",
    "solana-nft": "Anchor programs for Solana NFT development that can be tested locally with a test validator and deployed to devnet or mainnet. The project uses Rust with the Anchor framework and includes npm/pnpm scripts for building, testing, and upgrading smart contracts on the Solana blockchain.",
    "solana-nft-marketplace": "Solana NFT marketplace contract built with Anchor 0.18.2 for a 2021 hackathon, featuring NFT listing management, price updates, purchase functionality, and automatic marketplace fee and royalty distribution. The codebase likely contains outdated patterns due to its age and early Anchor version, but provides core e-commerce functionality for NFTs on Solana.",
    "solana-vault-example": "A minimal Solana-based tokenized vault implementation that accepts user deposits, mints ERC-4626 style vault shares, and enables authorized accounts to invest assets into external protocols via Cross-Program Invocation. The system uses SPL tokens for vault assets and SPL Token-2022 for share tokens, with a vault program managing core logic and a protocol adapter program demonstrating external protocol integration. Key features include deposit functionality with dynamic exchange rate calculations, share minting, and protocol investment tracking through a registry system.",
    "talks": "",
    "trader-smith": "A modular autonomous trading agent for Hyperliquid perpetual futures featuring advanced market-making strategies, comprehensive risk management, and real-time monitoring capabilities. The v2.0 architecture provides a clean separation of concerns with full type safety, robust error handling, and enhanced dashboard analytics. Designed for sophisticated traders who understand the inherent risks of algorithmic trading with real capital.",
    "vaicard": "",
    "vault": "A CLI tool that encrypts and removes sensitive files from disk using age encryption, allowing users to temporarily lock down directories like ~/.ssh, ~/.gnupg, and .env files before risky activities. Users can configure paths in ~/.config/vault/paths, then use simple commands to encrypt everything into a passphrase-protected archive or restore files when needed. This eliminates sensitive data as an attack surface without requiring key files on disk."
  }
}
