{
  "summaries": {
    "addressing": "A service that converts Brazilian postal codes (CEP) into full addresses. Built as a lightweight utility for address lookup integration in applications.",
    "algorit": "A web application framework combining a Vue.js frontend with Laravel Elixir, Sass, and Pug templating alongside a PHP and Lumen backend. The project provides a full-stack development environment for building modern web applications with integrated build tooling and styling capabilities.",
    "algorit.com.br": "Website code for http://algorit.com.br.",
    "aposente.ai": "",
    "autopilot": "A Solana-based automated vault system that allows users to invest single assets in concentrated liquidity pools with auto-compounding strategies. The vault intelligently swaps tokens, opens leveraged liquidity positions in calculated ranges, and rebalances every 5 minutes by collecting fees and adjusting positions based on market conditions. Built with Rust and Anchor, it uses market analysis algorithms to maximize yields across different market cycles.",
    "backup": "",
    "basedash": "A web application framework built on Laravel that provides database management and administration capabilities with a modern frontend built using Node.js and Bower dependencies. It includes comprehensive testing infrastructure with PHPUnit, asset building via Grunt, and database migrations for managing schema changes. The project requires PHP 5.4+, various Node.js tooling, and extensions like MCrypt and Intl to run.",
    "bean": "A personal finance and quantitative investing platform built with Beancount for double-entry accounting, Jupyter notebooks for analysis, and planned screeners for stock ranking using factor investing strategies. The project imports transactions from multiple data sources (B3, Nasdaq, Yahoo) and aims to implement portfolio analysis tools like Beta and VaR calculations. It combines plain-text accounting practices with automated financial data extraction and investment analysis workflows.",
    "bliv": "A Solana-based DeFi platform that enables users to liberate and optimize yields across decentralized finance protocols. Built with Rust smart contracts, Next.js frontend, and Anchor framework, it provides a local validator setup for development and a CLI tool for market management and token operations.",
    "bot": "A TypeScript trading bot for cryptocurrency markets that combines real-time CCXT data fetching with multiple technical analysis strategies including SMA crossover, RSI, MACD, Bollinger Bands, SuperTrend, and Smart Money Concepts analysis. The project provides a flexible framework with YAML configuration, strategy combination capabilities, and trade execution support across different exchanges and protocols, including backtesting capabilities for strategy validation.",
    "bovespa.io": "A Laravel-based web application for financial data management that requires PHP with Composer for backend dependencies, Node.js with npm and Bower for frontend assets, and uses Gulp for build tasks. The project includes a database layer with migrations and seeds, comprehensive PHP unit testing with code coverage reporting, and follows standard Laravel development practices.",
    "bulldesk-gridsome": "A Gridsome starter project that generates static Vue.js sites with Bootstrap styling, Markdown content management, and Netlify deployment integration. It includes built-in features like Forestry CMS integration, Google Analytics, sitemap generation, and Netlify forms for rapid development without requiring paid services. The project is designed for easy content editing through a CMS interface while maintaining a modern, performant static site architecture.",
    "bulldesk-landing": "",
    "bulldesk-lp": "",
    "bulldesk-teaser": "",
    "buscape": "",
    "cashier-iugu": "",
    "classification": "A Laravel-based system that classifies company attributes using an attribution classifier. The project includes models for companies, classification logic, and comprehensive feature tests that can be run with PHPUnit.",
    "claudio": "",
    "content-course": "A high-converting landing page for selling digital courses that accepts payments via both Stripe (credit cards) and Solana (cryptocurrency), built with Nuxt.js 3 and Tailwind CSS. The page is optimized for conversion with responsive design, pricing strategy documentation, and complete payment flow integration including webhook verification and course access management through Supabase.",
    "contracts": "A Solana contracts repository containing four smart contract modules: Gamed, Governance, Token Vesting, and Twister. The project includes a Next.js frontend (started with `yarn next`) and a worker service for devnet interaction (started with `just work devnet`).",
    "defi-automator": "A tool for automating DeFi portfolio management on Solana's Orca Whirlpools protocol, enabling users to create concentrated liquidity positions using algorithmic strategies with automatic rebalancing and fee collection. It supports strategies like \"One Tick Lower\" and \"One Tick Upper\" to generate yield based on price movements, with plans to expand to additional protocols and chains. The project is currently in early development using Node.js, Yarn, and MongoDB for portfolio configuration and management.",
    "dotfiles": "Personal configuration repository containing shell dotfiles (zsh, tmux, git), macOS setup automation, application backups, and coding agent tooling. Provides installation scripts and sync utilities to manage system configuration across development environments while maintaining security for sensitive files like SSH keys. Includes comprehensive setup instructions via a Just-based task runner for reproducible machine configuration.",
    "gabrielkoerich": "for Gabriel Koerich, a software engineer and entrepreneur with 17+ years of experience specializing in Rust and Solana smart contract development. Currently architecting DeFi protocols at Lulo, with a track record that includes founding Bulldesk, a marketing automation SaaS acquired in 2021.",
    "gabrielkoerich.github.io": "Website code for http://projects.gabrielkoerich.com/.",
    "granatum-php": "A PHP 7+ library that provides programmatic access to the Granatum financial API, enabling developers to integrate accounting and financial management features into their applications. It offers a clean interface for interacting with Granatum's financeiro services, streamlining integration with the platform's REST API endpoints.",
    "guidelines": "A collection of coding guidelines and standards for PHP, HTML, CSS, and JavaScript development that enforces PSR-2 and PSR-4 compliance for PHP, specifies 2-space indentation for web languages and 4-space for PHP, and requires contributions through GitHub Flow with pull requests to the develop branch. The guidelines cover PHPDoc formatting, HTML structure best practices, and emphasis on clean, maintainable code with English naming conventions and no abbreviations.",
    "home": "A project for managing containerized applications on a home server. It provides infrastructure and tooling to run and orchestrate multiple services in a containerized environment for personal use.",
    "homebrew-tap": "",
    "iafut": "",
    "innbox": "",
    "lighthouse": "",
    "lulo-cpi-example": "A Solana program demonstrating user vault integration with Lulo finance through Cross-Program Invocation (CPI), enabling users to deposit, earn interest, and withdraw funds with asynchronous processing for insufficient liquidity scenarios. The example showcases both synchronous transfers to Lulo and asynchronous withdrawal handling, adaptable for protocol reserves where only admins can manage deposits and withdrawals.",
    "meshbot": "Multi-agent orchestration framework that coordinates specialized agents (planner, coder, reviewer, tester) across various workflow patterns including delivery, parallel, chain, and scheduled execution modes. Supports dynamic agent creation, inter-agent routing, queue management with retry logic, and integrations with Telegram and Discord through a flexible persistence layer. Built as an experimental scaffold on the pi libraries ecosystem with extensibility for custom agent backends and workflows.",
    "mev": "A Rust-based starter template for building MEV bots on Solana that uses Jito's searcher and geyser clients to identify and execute backrun arbitrage strategies across DEXs like Raydium and Orca. The template pins dependencies to ensure consistency across the searcher-client, geyser-client, and geyser-protos crates, allowing developers to focus on bot implementation rather than boilerplate setup. It includes a reference implementation of a backrun arb bot that monitors the mempool for large trades, calculates profitable arbitrage routes, and executes transactions using Jito bundles.",
    "mind": "",
    "orchestrator": "A lightweight bash orchestrator that routes coding tasks to specialized AI agents (Claude, Codex, OpenCode) with full tool access, managing task state in YAML with support for task delegation and skill selection. Tasks flow through configurable states with dynamic agent profiling, context persistence, and optional review agents. Agents execute via CLI with enriched prompts and can spawn subtasks autonomously.",
    "pass": "",
    "passive-trading": "A cryptocurrency trading bot written in Python and Rust that automatically manages perpetual futures positions across multiple exchanges by creating and cancelling limit orders in a grid pattern, doubling down on losing positions to average entry prices, and closing positions at set profit targets. It operates as a contrarian market maker without relying on price predictions or technical indicators, and includes backtesting and optimization capabilities powered by evolutionary algorithms to find optimal trading configurations.",
    "portfolio": "A Rust-based portfolio manager that executes multiple trading strategies on Solana with support for perpetual futures, lending protocols, and yield farming. It includes backtesting capabilities, allocation monitoring with warnings, and AI-driven position recommendations for entries, exits, and hedges. The system deploys via Docker for containerized strategy execution.",
    "portfolio-guardian-saas": "Portfolio Guardian SaaS is a full-stack web application that monitors Solana cryptocurrency portfolios with real-time balance tracking, P&L analytics, and AI-powered insights. Built on Nuxt.js, Vue.js, and Supabase, it offers multiple subscription tiers enabling users to connect wallets, track perpetual positions, and receive automated alerts via Telegram. The platform supports social authentication and is designed for deployment on Vercel with comprehensive portfolio management features including asset allocation visualization and historical performance analysis.",
    "private": "A collection of utilities for managing privacy and backup operations. Provides command-line tools and functions to encrypt, secure, and backup data while maintaining privacy standards. Designed to help users protect sensitive information and maintain secure copies of important files.",
    "private-sol": "",
    "prospector": "",
    "python-agents-course": "A high-converting landing page for selling digital courses built with Nuxt.js 3 that accepts both Stripe credit card payments ($97) and Solana cryptocurrency payments (1 SOL). Features responsive design, payment verification, and optional Supabase integration for course access management, with deployment-ready setup for Vercel.",
    "quant": "",
    "service-manager": "A simple manager that runs services in sequence. It provides an easy way to orchestrate and control the execution of multiple services in a specified order. Licensed under the MIT License.",
    "skills": "A collection of independent, self-contained skills for AI agents where each skill is stored in its own directory with documentation and can be configured entirely through environment variables. The project provides a universal setup script that checks dependencies, prompts for API keys, and runs smoke tests, with each skill following the Agent Skills open standard for compatibility across Claude Code, Codex, OpenClaw, and other agent platforms. Skills cover a wide range of capabilities including GitHub interactions, cryptocurrency pricing, Solana smart contract auditing, and various productivity integrations.",
    "smart-money-concepts": "A TypeScript library that analyzes financial market structure using Smart Money Concepts (SMC) and ICT methodology, detecting patterns like order blocks, fair value gaps, and breaks of structure from OHLCV candle data. It provides real-time and bulk processing capabilities with zero runtime dependencies, returning structured market analysis including trend bias, price zones, and order block locations.",
    "solana-fib-cpi": "A minimal Solana program that computes Fibonacci sequences using recursive self-CPI calls, demonstrating the modular v2 crate approach without Anchor. It manages state through a PDA that stores the previous and current Fibonacci numbers plus remaining steps, with each instruction either initializing the computation or advancing one step until the recursion depth limit is reached.",
    "solana-nft": "An Anchor-based Solana NFT program with development setup instructions for testing and deployment across devnet and mainnet clusters. Includes deployment scripts, account management, and integration with the Solana test validator for local development. Built with Rust using the Anchor framework and tested via pnpm/Node.js tooling.",
    "solana-nft-marketplace": "A Solana smart contract built with Anchor 0.18.2 that implements an NFT marketplace with listing management, purchasing functionality, and automated fee distribution to the marketplace and royalty recipients. Developed in 2021 for a hackathon, it provides core features for trading NFTs including price updates, listing cancellation, and payment routing.",
    "solana-vault-example": "A Solana-based tokenized vault protocol that allows users to deposit SPL tokens and receive vault shares following ERC-4626 exchange rate mechanics, while enabling authorized administrators to invest vault assets into external protocols through Cross-Program Invocation. The system uses dual token support with SPL Token for vault assets and SPL Token-2022 for share tokens, along with a mock protocol adapter for demonstrating CPI integration patterns.",
    "talks": "",
    "trader-smith": "An autonomous trading agent for Hyperliquid perpetual futures featuring a modular architecture with advanced risk management, market making strategies, and real-time monitoring capabilities. Built with Python using Poetry for package management, it provides sophisticated trading automation with comprehensive error handling and type safety. Version 2.0 represents a complete refactoring from monolithic to modular design, with all core trading operations fully operational.",
    "vaicard": "",
    "vault": ""
  }
}
